Revit 2027 API
PathOfTravel.CreateMapped Method
Overload List
Name | Description
CreateMapped(View, IList<XYZ>, IList<XYZ>) |  Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points.
CreateMapped(View, IList<XYZ>, IList<XYZ>, IList<PathOfTravelCalculationStatus>) |  Creates multiple new paths of travel by mapping each of a set of start points to each of a set of end points and provides creation result statuses.
Top
See Also
Reference
PathOfTravel Class
Autodesk.Revit.DB.Analysis Namespace